#defineblock begin
/******************************************************************************
                            Trol MobileStudio                                 
                                                                              
                        Runtime libraries:  STDDEF.H
                                                                              
                      Copyright by O.A. Trifonov, 2006
                       
                              Version 0.5
                                                                              
    Created: 25.07.2006
                                                                              
                                                                              
******************************************************************************/

//----------------------------------------------------------------------------//
//                   макроопределения системных типов                         //
//----------------------------------------------------------------------------//

#ifdef JAVA

  #define     bool                  boolean
  #define     stdcall               public final

#endif

#defineblock end

